Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Now, the following code will work when the user is signing in into your application with both Google or GitHub:
ja_jp: これで、ユーザーが Google または GitHub の両方を使用してアプリケーションにサインインしているときに、次のコードが機能します。

source: Now, the following code will work when the user is signing in into your application with both `Google` or `GitHub`:
ja_jp: 次のコードは、ユーザーが `Google` または `GitHub` の両方でアプリケーションにサインインしている場合に動作します：

source: Now, the following code will work when the user signs into your application by using Google or GitHub:
ja_jp: これで、ユーザーが Google または GitHub を使用してアプリケーションにサインインすると、次のコードが機能するようになります。

source: Now, the tokens are ready to be stored in the database.
ja_jp: これで、トークンをデータベースに保存する準備が整いました。

source: Now, under `Client secrets (0)`, click on `New client secret`:
ja_jp: 次に、 `Client secrets (0)` の下にある `New client secret` をクリックします。

source: Now, update our `Hero` and `Ally` entities to implement this interface.
ja_jp: さて、このインタフェースを実装するために、 `Hero` と `Ally` のエンティティを更新します。

source: Now, use `OidcClient` to acquire the tokens and propagate them:
ja_jp: 次に、 `OidcClient` を使用してトークンを取得し、伝播します。

source: Now, we are ready to run our application:
ja_jp: これで、アプリケーションを実行する準備が整いました。

source: Now, we can create a `ReactiveFruitService` that leverages our reactive DAO:
ja_jp: これで、リアクティブ DAO を活用する `ReactiveFruitService` を作成できます。

source: Now, we can get to more exciting things!
ja_jp: さあ、もっとエキサイティングな話をしましょう!

source: Now, we just need to create the REST resource. Create the `src/main/java/org/acme/cache/WeatherForecastResource.java` file with this content:
ja_jp: あとは、RESTリソースを作成するだけです。 この内容で `src/main/java/org/acme/cache/WeatherForecastResource.java` ファイルを作成します。

source: Now, we just need to create the `src/main/java/org/acme/spring/cache/WeatherForecastResource.java` class to use the service and response:
ja_jp: あとは、サービスとレスポンスを使用するために `WeatherForecastResource` クラスを作成する必要があります。

source: Now, we need the other side: the component receiving the name and replying. Create the `src/main/java/org/acme/GreetingService.java` file with the following content:
ja_jp: さて、もう一方が必要です。名前を受け取って返信するコンポーネントです。以下の内容で `src/main/java/org/acme/GreetingService.java` を作成します：

source: Now, we need to _map_ the `movies` channel (the `Emitter` emits to this channel) to a Kafka topic and also _map_ the schema to be used on this channel. To achieve this, edit the `application.properties` file, and add the following content:
ja_jp: ここで、`movies` チャネル (`Emitter` がこのチャネルに出力) を Kafka トピックに _マップ_ し、このチャネルで使用されるスキーマも _マップ_ する必要があります。 これを実現するには、`application.properties` ファイルを編集し、次のコンテンツを追加します。

source: Now, we need to _map_ the `movies` channel (the `Emitter` emits to this channel) to a Kafka topic. To achieve this, edit the `application.properties` file, and add the following content:
ja_jp: ここで、 `movies` チャネル (`Emitter` はこのチャネルに出力) を Kafka トピックに _マップ_ する必要があります。これを実現するには、 `application.properties` ファイルを編集し、次のコンテンツを追加します。

source: Now, we should be able to call our service:
ja_jp: これで、私たちのサービスを呼び出すことができるはずです:

source: Now, what about live coding? It’s a popular feature of Quarkus and most NodeJS UI frameworks already have such a mode. Quinoa provides two options:
ja_jp: さて、ライブコーディングはどうでしょうか。これはQuarkusの人気機能で、ほとんどのNodeJS UIフレームワークにはすでにこのようなモードがあります。Quinoaには2つのオプションがあります。

source: Now, when you run an application created in either the <<vertx-oidc-to-quarkus-oidc>> or <<vertx-oidc-to-quarkus-oidc-custom-callback>> sections, you can observe that Quarkus OIDC also uses a `q_session` session cookie but it is significantly larger in size:
ja_jp: 一方、 <<vertx-oidc-to-quarkus-oidc>> または <<vertx-oidc-to-quarkus-oidc-custom-callback>> セクションで作成したアプリケーションを実行すると、Quarkus OIDC も `q_session` セッションクッキーを使用しますが、そのサイズが大幅に大きいことがわかります。

source: Now, whenever a REST method is invoked, the request will be logged into the console:
ja_jp: これで、RESTメソッドが呼び出されるたびに、リクエストがコンソールにログとして記録されるようになりました。

source: Now, with only the second service running, try ending the LRA:
ja_jp: ここで、2つ目のサービスだけが稼働している状態で、LRAを終了させてみます。

source: Now, you are ready to run the application in dev mode by using one of the following commands:
ja_jp: これで、次のいずれかのコマンドを使用して、アプリケーションを開発モードで実行する準備が整いました。

source: Now, you are ready to start authenticating your Quarkus users to the Okta SAML 2.0 provider by using an OIDC-to-SAML bridge provided by the Keycloak OIDC and Okta SAML 2.0 providers.
ja_jp: これで、Keycloak OIDC および Okta SAML 2.0 プロバイダーが提供する OIDC-to-SAML ブリッジを使用して、Quarkus ユーザーを Okta SAML 2.0 プロバイダーに認証する準備が整いました。

source: Now, you can compile and run the application but let's start it the dev mode with `mvn quarkus:dev`.
ja_jp: これで、アプリケーションをコンパイルして実行できるようになりました。 `mvn quarkus:dev` を使用して開発モードで起動してみましょう。

source: Now, you can use this client like this:
ja_jp: このクライアントは次のように使用できます。

source: Now, your Kafka messages will contain a JSON-B serialized representation of your `Fruit` data object.
ja_jp: これで、Kafka のメッセージには、JSON-B でシリアライズされた `Fruit` データオブジェクトの表現が含まれます。

source: Now, your Kafka messages will contain a Jackson serialized representation of your `Fruit` data object. In this case, the `deserializer` configuration is not necessary as the <<serialization-autodetection>> is enabled by default.
ja_jp: これで、Kafka メッセージには、 `Fruit` データオブジェクトの Jackson シリアライズ表現が含まれます。 この場合、<<serialization-autodetection>> がデフォルトで有効になっているので、 `deserializer` の設定は必要ありません。

source: Nowadays, systems we build consist of numerous applications, often called microservices. The system's overall behavior emerges from the interactions between all these services. So, a microservice is likely going to invoke other ones. But here is the catch. In dynamic environments, such as Kubernetes, or the Cloud, the locations of these services may change over time. So, how does our microservice locate the services it needs to call?
ja_jp: 現在、私たちが構築するシステムは、しばしばマイクロサービスと呼ばれる多数のアプリケーションで構成されています。システムの全体的な動作は、これらすべてのサービス間の相互作用から生まれます。つまり、あるマイクロサービスは、他のマイクロサービスを呼び出すことが多いのです。しかし、ここで問題が発生します。Kubernetesやクラウドのようなダイナミックな環境では、これらのサービスの場所は時間の経過とともに変化する可能性があります。では、マイクロサービスはどのようにして呼び出す必要のあるサービスを見つけるのでしょうか？

source: Number of IO threads.
ja_jp: IOスレッド数。

source: Number of arenas handling memory allocation
ja_jp: メモリ割り当てを処理するアリーナの数

source: Number of classes currently loaded.
ja_jp: 現在ロードされているクラスの数。

source: Number of classes loaded since JVM start.
ja_jp: JVM 起動以降にロードされたクラスの数。

source: Number of classes unloaded since JVM start.
ja_jp: JVM 起動以降にアンロードされたクラスの数。

source: Number of connections established between the client and each Broker. A value of 0 means to disable connection pooling.
ja_jp: クライアントと各 Broker 間で確立される接続の数。値 0 は、コネクション・プーリングを無効にすることを意味します。

source: Number of consumer listener threads.
ja_jp: コンシューマー・リスナーのスレッド数。

source: Number of executing platform threads.
ja_jp: 実行中のプラットフォームスレッド数。

source: Number of processors available to the Java virtual machine.
ja_jp: Java 仮想マシンで利用可能なプロセッサーの数。

source: Number of seconds that must not elapse since the token `iat` (issued at) time.
ja_jp: トークン発行時刻 `iat` から経過してはならない秒数です。

source: Number of thread-local caches for buffers
ja_jp: バッファー用のスレッドローカルキャッシュの数

source: Numbers
ja_jp: 数値

source: Numerical level value
ja_jp: レベルの数値

source: OAuth authentication works for both JVM and native modes. Since SSL in not enabled by default in native mode, `quarkus.ssl.native=true` must be added to support JaasClientOauthLoginCallbackHandler, which uses SSL. (See the xref:native-and-ssl.adoc[Using SSL with Native Executables] guide for more details.)
ja_jp: OAuth 認証は、JVM とネイティブモードの両方で動作します。SSL はネイティブモードでデフォルトで有効になっていないため、SSL を使用する JaasClientOauthLoginCallbackHandler をサポートするために、 `quarkus.ssl.native=true` を追加する必要があります（詳細は、xref:native-and-ssl.adoc[ネイティブイメージでのSSLの利用] ガイドを参照）。

source: OAuth2 authentication
ja_jp: OAuth2 認証

source: OAuth2 is an authorization framework that enables applications to obtain access to an HTTP resource on behalf of a user. It can be used to implement an application authentication mechanism based on tokens by delegating to an external server (the authentication server) the user authentication and providing a token for the authentication context.
ja_jp: OAuth2は、アプリケーションがユーザーに代わってHTTPリソースへのアクセスを取得することを可能にする認可フレームワークです。ユーザー認証を外部サーバー(認証サーバー)に委譲し、認証コンテキストにトークンを提供することで、トークンに基づくアプリケーション認証の仕組みを実装することができます。

source: OAuth2 providers such as GitHub do not return `IdToken`, and the user authentication is implicit and indirectly represented by the `access` token. This `access` token represents an authenticated user authorizing the current Quarkus `web-app` application to access some data on behalf of the authenticated user.
ja_jp: GitHub などの OAuth2 プロバイダは `IdToken` を返さないため、ユーザー認証は `access` トークンによって暗黙的かつ間接的に表現されます。 この `access` トークンは、現在のQuarkus `web-app` アプリケーションが認証されたユーザーに代わってデータにアクセスすることを認可する、認証されたユーザーを表します。

source: OAuth2 providers such as GitHub do not return `IdToken`, and the user authentication is implicit and indirectly represented by the `access` token. This `access` token represents an authenticated user authorizing the current Quarkus `web-app` application to access some data on the user's behalf.
ja_jp: GitHub などの OAuth2 プロバイダーは `IdToken` を返さないため、ユーザー認証は暗黙的であり、 `access` トークンによって間接的に表現されます。 この `access` トークンは、認証されたユーザーが現在の Quarkus `web-app` アプリケーションにユーザーに代わってデータにアクセスすることを認可していることを表します。

source: OAuth2 providers such as GitHub do not return `IdToken`, the fact of the user authentication is implicit and is indirectly represented by the `access` token which represents an authenticated user authorizing the current Quarkus `web-app` application to access some data on behalf of the authenticated user.
ja_jp: GitHub のような OAuth2 プロバイダーは `IdToken` を返しません。ユーザー認証の事実は暗黙の了解で、認証済みユーザーの代わりに現在の Quarkus `web-app` アプリケーションがデータにアクセスすることを許可する `access` トークンで間接的に表現されます。

source: OAuth2 servers might not support a well-known configuration endpoint. In this case, you must disable the discovery and configure the authorization, token, and introspection and `UserInfo` endpoint paths manually.
ja_jp: OAuth2 サーバーは、よく知られた設定エンドポイントをサポートしていない可能性があります。 この場合、検出を無効にして、認可、トークン、イントロスペクション、および `UserInfo` エンドポイントパスを手動で設定する必要があります。

source: OIDC - Support for Proof Of Key for Code Exchange (PKCE)
ja_jp: OIDC - Proof Of Key for Code Exchange (PKCE)のサポート

source: OIDC Client Registration
ja_jp: OIDC クライアント登録

source: OIDC Client SPI
ja_jp: OIDC クライアント SPI

source: OIDC Code Authentication Mechanism acquires three tokens during the authorization code flow: https://openid.net/specs/openid-connect-core-1_0.html#IDToken[IDToken], Access Token and Refresh Token.
ja_jp: OIDC コード認証メカニズムは、認可コードフローにおいて https://openid.net/specs/openid-connect-core-1_0.html#IDToken[IDトークン] 、アクセストークン、リフレッシュトークンの 3 つのトークンを取得します。

source: OIDC Database Token State Manager uses a Reactive SQL client under the hood to avoid blocking because the authentication is likely to happen on an IO thread.
ja_jp: OIDC Database Token State Manager は、認証が IO スレッドで行われる可能性が高いため、ブロックを回避するために内部で Reactive SQL クライアントを使用します。

source: OIDC HTTP client redirects
ja_jp: OIDC HTTP クライアントリダイレクト

source: OIDC Health Check
ja_jp: OIDC ヘルスチェック

source: OIDC Metadata properties
ja_jp: OIDC メタデータプロパティー

source: OIDC SAML identity broker
ja_jp: OIDC SAML アイデンティティーブローカー

source: OIDC `CodeAuthenticationMechanism` is using the default `io.quarkus.oidc.TokenStateManager` interface implementation to keep the ID, access and refresh tokens returned in the authorization code or refresh grant responses in a session cookie. It makes Quarkus OIDC endpoints completely stateless.
ja_jp: OIDC `CodeAuthenticationMechanism` は、デフォルトの `io.quarkus.oidc.TokenStateManager` インターフェイス実装を使用して、認可コードで返された ID、アクセス、更新トークンを保持するか、セッション Cookie の付与応答を更新します。これにより、Quarkus OIDC エンドポイントは完全にステートレスになります。

source: OIDC `CodeAuthenticationMechanism` uses the default `io.quarkus.oidc.TokenStateManager` interface implementation to keep the ID, access, and refresh tokens returned in the authorization code or refresh grant responses in an encrypted session cookie.
ja_jp: OIDC `CodeAuthenticationMechanism` は、デフォルトの `io.quarkus.oidc.TokenStateManager` インターフェイス実装を使用して、認可コードまたはリフレッシュ付与応答で返された ID、アクセストークン、およびリフレッシュトークンを暗号化されたセッションクッキーに保存します。

source: OIDC `service` application needs to know OpenID Connect provider's token, `JsonWebKey` (JWK) set and possibly `UserInfo` and introspection endpoint addresses.
ja_jp: OIDC `service` アプリケーションは、OpenID Connect プロバイダのトークン、 `JsonWebKey` (JWK) セット、そして時には `UserInfo` とイントロスペクションのエンドポイントアドレスを知る必要があります。

source: OIDC `web-app` application needs to know OpenID Connect provider's authorization, token, `JsonWebKey` (JWK) set and possibly `UserInfo`, introspection and end session (RP-initiated logout) endpoint addresses.
ja_jp: OIDC `web-app` アプリケーションは OpenID Connect プロバイダーの認証、トークン、 `JsonWebKey` (JWK) セット、そしておそらく `UserInfo`、イントロスペクション、エンドポイント (RP が起動するログアウト) アドレスを知っている必要があります。

source: OIDC and SAML Identity broker
ja_jp: OIDC と SAML アイデンティティーブローカー

source: OIDC application type determines how the the current request is authenticated.
ja_jp: OIDC アプリケーションタイプは、現在のリクエストがどのように認証されるかを決定します。

source: OIDC authentication completion actions
ja_jp: OIDC 認証完了アクション

source: OIDC authentication mechanism
ja_jp: OIDC 認証メカニズム

source: OIDC authentication mechanism can be affected if your Quarkus application is running behind a reverse proxy/gateway/firewall when HTTP `Host` header may be reset to the internal IP address, HTTPS connection may be terminated, etc. For example, an authorization code flow `redirect_uri` parameter may be set to the internal host instead of the expected external one.
ja_jp: Quarkusアプリケーションがリバースプロキシー/ゲートウェイ/ファイアウォールの背後で実行されている場合、HTTP `Host` ヘッダーが内部IPアドレスにリセットされたり、HTTPS接続が終了したりした場合などに、OIDC認証メカニズムが影響を受けることがあります。たとえば、認可コードフロー `redirect_uri` パラメーターが、期待される外部ホストではなく内部ホストに設定されている場合があります。

source: OIDC authorization code flow mechanism
ja_jp: OIDC 認可コードフローメカニズム

source: OIDC base URL
ja_jp: OIDC ベース URL

source: OIDC callback URL
ja_jp: OIDC コールバック URL

source: OIDC client
ja_jp: OIDC クライアント

source: OIDC client id
ja_jp: OIDC クライアント ID

source: OIDC client registration path
ja_jp: OIDC クライアント登録パス

source: OIDC configuration
ja_jp: OIDC設定

source: OIDC enablement property
ja_jp: OIDC 有効化プロパティー

source: OIDC is different from OAuth2 because it adds a new type of token representing the user authentication, `ID token`. `quarkus-oidc` works with compliant OIDC providers which return an ID token but also has to support OAuth2 providers which do not return it. Use `quarkus.oidc.authentication.id-token-required=false` to tell Quarkus that your provider can not provide a required ID token. In this case, Quarkus generates an internal ID token to represent a session. Quarkus OIDC also expects that the OAuth2 provider specific `UserInfo` endpoint path is configured with `quarkus.oidc.user-info-path` to fetch information about the current user.
ja_jp: OIDC は、ユーザー認証を表す新しいタイプのトークンである `ID トークン` を追加するため、OAuth2 とは異なります。 `quarkus-oidc` は ID トークンを返す準拠した OIDC プロバイダーで動作しますが、それを返さない OAuth2 プロバイダーもサポートする必要があります。 `quarkus.oidc.authentication.id-token-required=false` を使用して、プロバイダーが必須の ID トークンを提供できないことを Quarkus に伝えます。この場合、Quarkus はセッションを表す内部 ID トークンを生成します。また、Quarkus OIDC は、現在のユーザーに関する情報を取得するために、OAuth2 プロバイダー固有の `UserInfo` エンドポイントパスが `quarkus.oidc.user-info-path` で設定されていることを期待します。

source: OIDC provider client authentication
ja_jp: OIDC プロバイダーのクライアント認証

source: OIDC providers behind a firewall may redirect Quarkus OIDC HTTP client's GET requests to some of its endpoints such as a well-known configuration endpoint. By default, Quarkus OIDC HTTP client follows HTTP redirects automatically, excluding cookies which may have been set during the redirect request for security reasons.
ja_jp: ファイアウォールの背後にある OIDC プロバイダーは、Quarkus OIDC HTTP クライアントの GET リクエストを、既知の設定エンドポイントなどのエンドポイントにリダイレクトする場合があります。 デフォルトでは、Quarkus OIDC HTTP クライアントは、セキュリティー上の理由からリダイレクトリクエスト中に設定された Cookie を除外して、自動的に HTTP リダイレクトい従います。

source: OIDC providers behind a firewall might redirect the Quarkus OIDC HTTP client's GET requests to some of their endpoints, such as a well-known configuration endpoint. By default, Quarkus OIDC HTTP client follows HTTP redirects automatically, excluding cookies that might have been set during the redirect request for security reasons.
ja_jp: ファイアウォールの背後にある OIDC プロバイダーは、Quarkus OIDC HTTP クライアントの GET リクエストを、既知の設定エンドポイントなどのエンドポイントにリダイレクトする場合があります。 デフォルトでは、Quarkus OIDC HTTP クライアントは、セキュリティー上の理由からリダイレクトリクエスト中に設定された Cookie を除外して、自動的に HTTP リダイレクトに従います。

source: OIDC providers typically require applications to be identified and authenticated when they interact with the OIDC endpoints. Quarkus OIDC, specifically the `quarkus.oidc.runtime.OidcProviderClient` class, authenticates to the OIDC provider when the authorization code must be exchanged for the ID, access, and refresh tokens, or when the ID and access tokens must be refreshed or introspected.
ja_jp: OIDC プロバイダーは通常、OIDC エンドポイントとやり取りする際に、アプリケーションの識別と認証を行う必要があります。 Quarkus OIDC、特に `quarkus.oidc.runtime.OidcProviderClient` クラスは、認可コードを ID、アクセス、リフレッシュトークンと交換する必要がある場合、または ID やアクセストークンをリフレッシュまたはイントロスペクトする必要がある場合に、OIDC プロバイダーで認証します。

source: OIDC providers use link:https://openid.net/specs/openid-connect-backchannel-1_0.html[Back-channel logout] to log out the current user from all the applications into which this user is currently logged in, bypassing the user agent.
ja_jp: OIDCプロバイダは、 link:https://openid.net/specs/openid-connect-backchannel-1_0.html[バックチャネルログアウト] を使用して、ユーザエージェントをバイパスして、そのユーザが現在ログインしているすべてのアプリケーションから現在のユーザをログアウトします。

source: OIDC providers use the link:https://openid.net/specs/openid-connect-backchannel-1_0.html[Back-channel logout] to log out the current user from all the applications the user is currently logged into, bypassing the user agent.
ja_jp: OIDC プロバイダーは、link:https://openid.net/specs/openid-connect-backchannel-1_0.html[バックチャネルログアウト] を使用して、ユーザエージェントをバイパスして、そのユーザが現在ログインしているすべてのアプリケーションから現在のユーザをログアウトします。

source: OIDC providers usually issue signed ID and access tokens but may also additionally encrypt these tokens which Quarkus needs to decrypt to verify them. Choose which token types must be decrypted: the ID token with `quarkus.oidc.token.decrypt-id-token`, or the access token with `quarkus.oidc.token.decrypt-access-token`.
ja_jp: OIDC プロバイダーは通常、署名済みの ID トークンやアクセストークンを発行しますが、さらにこれらのトークンを暗号化する場合もあり、Quarkus は検証のためにこれらを復号化する必要があります。復号化が必要なトークンタイプを、ID トークンなら `quarkus.oidc.token.decrypt-id-token`、アクセストークンなら `quarkus.oidc.token.decrypt-access-token` で選択してください。

source: OIDC redirect filters
ja_jp: OIDC リダイレクトフィルター

source: OIDC redirects
ja_jp: OIDC リダイレクト

source: OIDC request filters
ja_jp: OIDC リクエストフィルター

source: OIDC requests
ja_jp: OIDC リクエスト

source: OIDC response filters
ja_jp: OIDC レスポンスフィルター

source: OIDC response mode
ja_jp: OIDC レスポンスモード

source: OIDC responses
ja_jp: OIDC レスポンス

source: OIDC security identity is also available because enabling an inclusive authentication requires all registered mechanisms to produce the security identity.
ja_jp: 統合認証を有効にするには、登録されているすべてのメカニズムでセキュリティーアイデンティティーを生成する必要があるため、OIDC セキュリティーアイデンティティーも利用できます。

source: OIDC tenant properties
ja_jp: OIDC テナントプロパティー

source: OIDC tenants are resolved in the following order:
ja_jp: OIDC テナントは、以下の順序で解決されます。

source: OIDC tenants can be created programmatically like in the example below:
ja_jp: OIDC テナントは、次の例のようにプログラムで作成できます。

source: OIDC tenants can be created programmatically, as follows:
ja_jp: OIDC テナントは、次のようにプログラムで作成できます。

source: OIDC tenants that support Bearer token authentication can be resolved using the custom HTTP header that contains the token. Header-based resolution is enabled when the `quarkus.oidc.token.header` property is set to a value other than `Authorization`. For example:
ja_jp: ベアラー認証をサポートする OIDC テナントは、トークンを含むカスタム HTTP ヘッダーを使用して解決できます。ヘッダーベースの解決は、`quarkus.oidc.token.header` プロパティーが `Authorization` 以外の値に設定されている場合に有効になります。例:

source: OIDC tenants which support Bearer token authentication can be resolved using the access token's issuer. The following conditions must be met for the issuer-based resolution to work:
ja_jp: ベアラートークン認証をサポートする OIDC テナントは、アクセストークンの issuer を使用して解決できます。 issuer ベースの解決が機能するには、次の条件を満たす必要があります。

source: OIDC token endpoint address
ja_jp: OIDC トークンエンドポイントアドレス

source: OIDC token propagation
ja_jp: OIDCトークンの伝搬

source: OIDC topic
ja_jp: OIDC トピック

source: OK, injection looks cool. What other services are provided?
ja_jp: OK、インジェクションは便利ですね。他にはどんなサービスが提供されていますか?

source: OK. Let's start simple. What is a bean?
ja_jp: まず、シンプルなことから始めます。Beanとは何でしょうか?

source: OK. You said that there are several kinds of beans?
ja_jp: そうですか。Beanは何種類かあるんですよね?

source: OS thread
ja_jp: OS スレッド

source: OTel Sampler SPI
ja_jp: OTelサンプラーSPI

source: Object Substitution
ja_jp: オブジェクトの置換

source: Objects created during the build phase that are passed into the runtime need to have a default constructor in order for them to be created and configured at startup of the runtime from the build time state. If an object does not have a default constructor you will see an error similar to the following during generation of the augmented artifacts:
ja_jp: ランタイムに渡されるビルドフェーズ中に作成されたオブジェクトは、ビルド時の状態からランタイムの起動時に作成および設定できるよう、デフォルトのコンストラクターを持っている必要があります。オブジェクトにデフォルトのコンストラクターがない場合、拡張アーティファクトの生成中に次のようなエラーが表示されます。

source: Objects of type `String`, `JsonObject`, `JsonArray`, `Buffer`, and `byte[]` are sent as-is and bypass the serialization and deserialization. When no codec is provided, the serialization and deserialization convert the message from/to JSON automatically.
ja_jp: `String`、 `JsonObject`、 `JsonArray`、 `Buffer`、および `byte[]` タイプのオブジェクトはそのまま送信され、シリアライゼーションとデシリアライゼーションをバイパスします。 コーデックが指定されていない場合、シリアライゼーションとデシリアライゼーションによってメッセージは JSON から、または JSON に自動的に変換されます。

source: Objects returned from a previous recorder invocation
ja_jp: 前回のレコーダー起動時に返されたオブジェクト

source: Objects that implement `java.util.concurrent.CompletionStage` and `io.smallrye.mutiny.Uni` are evaluated in a special way. If a part of an expression resolves to a `CompletionStage`, the resolution continues once this stage is completed and the next part of the expression (if any) is evaluated against the result of the completed stage. For example, if there is an expression `{foo.size}` and `foo` resolves to `CompletionStage<List<String>>` then `size` is resolved against the completed result, i.e. `List<String>`. If a part of an expression resolves to a `Uni`, a `CompletionStage` is first created from `Uni` using `Uni#subscribeAsCompletionStage()` and then evaluated as described above.
ja_jp: `java.util.concurrent.CompletionStage` および `io.smallrye.mutiny.Uni` を実装したオブジェクトは、特別な方法で評価されます。 式の一部が `CompletionStage` に解決された場合、このステージが完了すると解決が継続され、式の次のパーツ (もしあれば) が完了したステージの結果に対して評価されます。 たとえば、式 `{foo.size}` があり、`foo` が `CompletionStage<List<String>> に解決される場合、`size` は完了した結果、すなわち `List<String>` に対して解決されます。 式の一部が `Uni` に解決される場合、`CompletionStage` が `Uni#subscribeAsCompletionStage()` を使用して `Uni` から最初に作成され、その後上記のように評価されます。

source: Objects which are injected into a build step method or its class _must not_ be used outside of that method's execution.
ja_jp: ビルドステップのメソッドやそのクラスに注入されたオブジェクトは、そのメソッドの実行時以外に使用しては _いけません_ 。

source: Objects which are injected into a build step method or its class _must not_ be used outside that method's execution.
ja_jp: ビルドステップのメソッドやそのクラスに注入されたオブジェクトは、そのメソッドの実行時以外に使用しては _いけません_ 。

source: Objects with a constructor annotated with `@RecordableConstructor` with parameter names that match field names
ja_jp: フィールド名と一致するパラメーター名を持つ `@RecordableConstructor` でアノテーションが付けられたコンストラクターを持つオブジェクト

source: Objects with a no-arg constructor and getter/setters for all properties (or public fields)
ja_jp: すべてのプロパティー (またはパブリックフィールド) の引数なしコンストラクターとゲッター/セッターを持つオブジェクト

source: Observability Dev Services with Grafana OTel LGTM
ja_jp: Observability Dev Services と Grafana OTel LGTM

source: Observability Include
ja_jp: オブザーバビリティインクルード
